In [14]:
#importing python dependencies
import pandas as pd

In [15]:
#Find Dataset

# About Dataset
# The food server of a restaurant recorded data about the tips given to the waiters for serving the food. The data recorded by the food server is as follows:

# total_bill: Total bill in dollars including taxes
# tip: Tip given to waiters in dollars
# sex: gender of the person paying the bill
# smoker: whether the person smoked or not
# day: day of the week
# time: lunch or dinner
# size: number of people in a table

In [16]:
#load the dataset
url = "tips.csv"
df = pd.read_csv(url)
print(df)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [17]:
#check for null values
print(df.isnull().values.any())

False

In [18]:
print(df.describe())

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [19]:
#Dimension of the dataframe 
print("Size=", df.size)
print("Shape=", df.shape)
print("Dimension=", df.ndim)

Size= 1708
Shape= (244, 7)
Dimension= 2

In [21]:
#providing variables discriptions
print(df.dtypes)

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [22]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB
None

In [25]:
#type conversion example
df1 = df.copy()
df1["total_bill"] = df1["total_bill"].astype("int64")
df1.head()

   total_bill   tip     sex smoker  day    time  size
0          16  1.01  Female     No  Sun  Dinner     2
1          10  1.66    Male     No  Sun  Dinner     3
2          21  3.50    Male     No  Sun  Dinner     3
3          23  3.31    Male     No  Sun  Dinner     2
4          24  3.61  Female     No  Sun  Dinner     4

In [28]:
#Turn categorical variables into quantitative variables in Python.
df2=df.copy()
df2["female"]=1*(df2["sex"]=="Female")
df2["male"]=1*(df2["sex"]=="Male")
print(df2["male"])

0      0
1      1
2      1
3      1
4      0
      ..
239    1
240    0
241    1
242    1
243    0
Name: male, Length: 244, dtype: int64

In [29]:
df2.head()

   total_bill   tip     sex smoker  day    time  size  female  male
0       16.99  1.01  Female     No  Sun  Dinner     2       1     0
1       10.34  1.66    Male     No  Sun  Dinner     3       0     1
2       21.01  3.50    Male     No  Sun  Dinner     3       0     1
3       23.68  3.31    Male     No  Sun  Dinner     2       0     1
4       24.59  3.61  Female     No  Sun  Dinner     4       1     0